"""
문제
평소 반상회에 참석하는 것을 좋아하는 주희는 이번 기회에 부녀회장이 되고 싶어 각 층의 사람들을 불러 모아 반상회를 주최하려고 한다.
이 아파트에 거주를 하려면 조건이 있는데, “a층의 b호에 살려면 자신의 아래(a-1)층의 1호부터 b호까지 사람들의 수의 합만큼 사람들을 데려와 살아야 한다” 는 계약 조항을 꼭 지키고 들어와야 한다.
아파트에 비어있는 집은 없고 모든 거주민들이 이 계약 조건을 지키고 왔다고 가정했을 때, 주어지는 양의 정수 k와 n에 대해 k층에 n호에는 몇 명이 살고 있는지 출력하라. 단, 아파트에는 0층부터 있고 각층에는 1호부터 있으며, 0층의 i호에는 i명이 산다.

입력
첫 번째 줄에 Test case의 수 T가 주어진다. 그리고 각각의 케이스마다 입력으로 첫 번째 줄에 정수 k, 두 번째 줄에 정수 n이 주어진다

출력
각각의 Test case에 대해서 해당 집에 거주민 수를 출력하라.
"""

# 런타임 에러 발생. 아예 수학적으로 풀거나, 중간 과정을 단순화하거나.
# 컴퓨터 로직 상으로는 딱 그대로인데.. 수학적으로 풀라는 건가.
#ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ 아래층만 더하면 되는 거였네. 나는 왜 밑바닥부터 더하고 있었을까

# 하지만 또 런타임 에러가 발생해버렸죠...?
# ㅋㅋㅋㅋㅋ Module not Found... numpy를 인식 못하던 거였어.
import sys
case_num = int(sys.stdin.readline())
for _ in range(case_num) :
    k = int(sys.stdin.readline())
    n = int(sys.stdin.readline())
    lst = [i for i in range(1,n+1)]
    sum_all = sum(lst)
    for _ in range(1,k) :
        lst = [sum(lst[:i+1]) for i in range(n)]  # a 번째 층을 불러서 0~i번째 항목까지 각 더한 list
    sum_all = sum(lst)

    print(sum_all)

