# 10172 개 프린트하기 (완료)
# |\_/|
# |q p|   /}
# ( 0 )"""\
# |"^"`    |
# ||_/=\\__|

"""
요점 1: \n을 통해서 한번에 print하려고 하면, \와 혼용될 수 있다.
A_1. 개별적으로 print 하는 것이 제일 쉽게 풀 수 있다.
A_2. Python 에서 \, ", ' 순서대로 백슬래시, 큰따옴표, 작은따옴표를 print 출력하기 위해서는 해당 문자 앞에 \ (백슬래시)를 붙여서 적어줘야한다.


요점 2: ", ' 을 구분하여 Print 할 수 있는가?
A_1. 따로 출력해준 다음 합쳐도 된다. 단 합쳤을 때 space 1개가 자동으로 들어간다는 걸 고려해야 한다.

요점 3 : "와 '가 한꺼번에 표현되면 어떻게 표현할 것인가?
A_1. 새로운 문자열로 정의해준 다음에 풀어주면 된다.
"""

print('|\_/|')
print('|q p|   /}')
print('( 0 )"""\\') # space 1개를 빼야할 것 같은데
print('|"^"`    |')
print('||_/=\\\__|')


