"""
Q.2753 윤년

문제
연도가 주어졌을 때, 윤년이면 1, 아니면 0을 출력하는 프로그램을 작성하시오.
윤년은 연도가 4의 배수이면서, 100의 배수가 아닐 때 또는 400의 배수일 때이다.
예를 들어, 2012년은 4의 배수이면서 100의 배수가 아니라서 윤년이다. 1900년은 100의 배수이고 400의 배수는 아니기 때문에 윤년이 아니다. 하지만, 2000년은 400의 배수이기 때문에 윤년이다.
> A. 4의 배수 인 경우, 4의 배수이지만 100의 배수인 경우는 제외, 다시 400의 배수는 포함
> 가장 공통된 조건인 400배수, 100배수, 4의 배수 순으로 조건문을 달면 될 것

입력
첫째 줄에 연도가 주어진다. 연도는 1보다 크거나 같고, 4000보다 작거나 같은 자연수이다.
> A. input() 함수 사용

출력
첫째 줄에 윤년이면 1, 아니면 0을 출력한다.

"""

A = int(input())
if A % 400 == 0 : print(1)
elif A % 100 == 0 : print(0)
elif A % 4 == 0 : print(1)
else : print(0)

